app/controllers/post_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def top
    @rooms=Post.all.order(created_at:"desc")

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", "1"], ["LIMIT", 1]]
INSERT INTO "posts" ("room", "user_id", "name_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["room", "11"], ["user_id", "1"], ["name_id", "1"], ["created_at", "2020-03-07 15:47:49.788285"], ["updated_at", "2020-03-07 15:47:49.788285"]]
---
  def new
    unless @room=Post.find_by(user_id: session[:user_id])
      @room=Post.new(room: params[:room], name_id: session[:user_name], user_id: session[:user_id])
      @room.save