app/controllers/room_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."room_id" = ? ORDER BY "chats"."created_at" DESC  [["room_id", "1"]]
---
  def top
    @room=Post.find_by(id: params[:id])
    @chats=Chat.where(room_id: params[:id]).order(created_at:"desc")

INSERT INTO "chats" ("name", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1"], ["room_id", "1"], ["content", "gsr"], ["created_at", "2020-03-07 15:47:57.457923"], ["updated_at", "2020-03-07 15:47:57.457923"]]
---
  def create
    @chats=Chat.new(name: session[:user_name], room_id: params[:id], content: params[:content])
    @chats.save

SELECT "chats".* FROM "chats" WHERE "chats"."room_id" = ?  [["room_id", "2"]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    @chat=Chat.where(room_id: params[:id])
    @chat.destroy_all
    @room=Post.find_by(id: params[:id])
    @room.destroy