app/controllers/user_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1"], ["email", "1"], ["password", "1"], ["created_at", "2020-03-07 15:47:41.905872"], ["updated_at", "2020-03-07 15:47:41.905872"]]
---
  def new
    @user=User.new(name: params[:name], email: params[:email], password: params[:password])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "3"], ["password", "3"], ["LIMIT", 1]]
---
  def confirm
    @user=User.find_by(email: params[:email], password: params[:password])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user=User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "124e"], ["updated_at", "2020-03-07 15:48:22.663839"], ["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", "1"], ["LIMIT", 1]]
UPDATE "posts" SET "name_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name_id", "124e"], ["updated_at", "2020-03-07 15:48:22.688948"], ["id", 1]]
---
  def change
    @user=User.find_by(id: params[:id])
    @user.name=params[:name]
    @user.save
    if @room=Post.find_by(user_id: session[:user_id])
      @room.name_id=params[:name]
      @room.save